// Теперь попробуйте сами. Сделайте map для хранения прейскуранта в рублях:
// хлеб — 50,
// молоко — 100,
// масло — 200,
// колбаса — 500,
// соль — 20,
// огурцы — 200,
// сыр — 600,
// ветчина — 700,
// буженина — 900,
// помидоры — 250,
// рыба — 300,
// хамон — 1500.
// Выведите перечень деликатесов — продуктов дороже 500 рублей.
// Заказ выдан слайсом []string{"хлеб", "буженина", "сыр", "огурцы"}. Посчитайте стоимость заказа.

package main

import "fmt"

func main() {
	prices := map[string]int{"хлеб":50,"молоко":100,"масло":200,"колбаса":500,"соль":20,"огурцы":200,"сыр":600,"ветчина":700,"буженина":900,"помидоры":250,"рыба":300,"хамон":1500}
	var delicatesses []string
	order := []string{"хлеб", "буженина", "сыр", "огурцы"}
	order_summ := 0

	for k, v := range prices {
		if v > 500 {
			delicatesses = append(delicatesses, k)
		}
		for _, pos := range order {
			if pos == k {
				order_summ += v
			}
		}
	}

	fmt.Printf("Список деликатесов: %v\n", delicatesses)
	fmt.Printf("Сумма заказа: %d", order_summ)
}



// Ответ:
// pricelist := map[string]int{"хлеб": 50, "молоко": 100, "масло": 200, "колбаса": 500, "соль": 20, "огурцы": 200, "сыр": 600, "ветчина": 700, "буженина": 900, "помидоры": 250, "рыба": 300, "хамон": 1500,}
// order := []string{"хлеб", "буженина", "сыр", "огурцы"}
// total := 0
// fmt.Println("Перечень деликатесов:")
// for k, v := range pricelist{
//     if v > 500{
//         fmt.Println(k)
//     }
// }
// for _, v := range order{
//     total += pricelist[v]
// }
// fmt.Println("Стоимость заказа ", total) 